<h2 style='color:purple' align='center'>Naive Bayes Tutorial Part 1: Predicting survival from titanic crash</h2>

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [3]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [4]:
inputs = df.drop('Survived',axis='columns')
target = df.Survived

In [5]:
#inputs.Sex = inputs.Sex.map({'male': 1, 'female': 2})

In [6]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [7]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

**I am dropping male column as well because of dummy variable trap theory. One column is enough to repressent male vs female**

In [8]:
inputs.drop(['Sex','male'],axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [9]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [10]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [11]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [12]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)

In [13]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [14]:
model.fit(X_train,y_train)

GaussianNB()

In [15]:
model.score(X_test,y_test)

0.7686567164179104

In [16]:
X_test[0:10]

     Pclass        Age      Fare  female
90        3  29.000000    8.0500       0
660       1  50.000000  133.6500       0
634       3   9.000000   27.9000       1
453       1  49.000000   89.1042       0
290       1  26.000000   78.8500       1
416       2  34.000000   32.5000       1
519       3  32.000000    7.8958       0
883       2  28.000000   10.5000       0
264       3  29.699118    7.7500       1
281       3  28.000000    7.8542       0

In [17]:
y_test[0:10]

90     0
660    1
634    0
453    1
290    1
416    1
519    0
883    0
264    0
281    0
Name: Survived, dtype: int64

In [18]:
model.predict(X_test[0:10])

array([0, 1, 1, 1, 1, 1, 0, 0, 1, 0], dtype=int64)

In [19]:
model.predict_proba(X_test[:10])

array([[0.9714242 , 0.0285758 ],
       [0.00732093, 0.99267907],
       [0.33487047, 0.66512953],
       [0.26754432, 0.73245568],
       [0.01779775, 0.98220225],
       [0.2612674 , 0.7387326 ],
       [0.97199342, 0.02800658],
       [0.93855949, 0.06144051],
       [0.45625726, 0.54374274],
       [0.97109552, 0.02890448]])

**Calculate the score using cross validation**

In [24]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train, y_train, cv=10)

array([0.74603175, 0.74603175, 0.79365079, 0.74193548, 0.79032258,
       0.79032258, 0.88709677, 0.80645161, 0.72580645, 0.72580645])

In [25]:
cross_val_score(GaussianNB(),X_train, y_train, cv=10).mean()

0.7753456221198156